---
kind: property
id: P:Autodesk.Revit.DB.TableData.FreezeColumnsAndRows
source: html/6de1e628-31ce-7de1-d53d-9d1b57553bb1.htm
---
# Autodesk.Revit.DB.TableData.FreezeColumnsAndRows Property

set to true if the columns and rows should be unmovable by the slider grips

## Syntax (C#)
```csharp
public bool FreezeColumnsAndRows { get; set; }
```